released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/sgpio_slave.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "sgpio_slave.h"

/*_____ D E C L A R A T I O N S ____________________________________________*/
extern unsigned long get_systick(void);
extern uint32_t get_tick(void);

typedef struct
{
    uint32_t frame_count;
    uint32_t dropped_frames;
    uint16_t bit_count;
    uint16_t act_mask;
    uint16_t locate_mask;
    uint16_t fail_mask;
    uint8_t raw[SGPIO_SLAVE_RX_MAX_BYTES];
    uint8_t raw_len;
    uint8_t sload_raw;
    uint8_t sload_raw_valid;
    uint8_t low_sync_count;
    uint8_t overflow;
    uint8_t valid;
} SGPIO_FRAME_T;

/*_____ D E F I N I T I O N S ______________________________________________*/
#define SGPIO_LOW_SYNC_MIN_BITS           (5U)
#define SGPIO_SLOAD_RAW_BITS              (4U)
#define SGPIO_DATA_BITS_PER_SLOT          (3U)
#define SGPIO_DECODE_SLOT_COUNT           (SGPIO_SLAVE_MAX_SLOTS)
#define SGPIO_SLOT_BIT_MAX                (SGPIO_SLAVE_MAX_SLOTS * SGPIO_DATA_BITS_PER_SLOT)
#define SGPIO_FRAME_GAP_TIMEOUT_MS        (5UL)
#define SGPIO_FRAME_ARM_TIMEOUT_MS        (20UL)
#define SGPIO_FRAME_LOG_FIRST_N           (1UL)
#define SGPIO_FRAME_LOG_MIN_INTERVAL_MS   (1000UL)
#define SGPIO_FRAME_STABLE_REQUIRED       (2U)
#define SGPIO_UNSTABLE_LOG_MIN_INTERVAL_MS (3000UL)

#define SGPIO_LED_OD_COUNT                (8U)
#define SGPIO_LED_GROUP_COUNT             (4U)
#define SGPIO_LED_MODE_OFF                (0U)
#define SGPIO_LED_MODE_ON                 (1U)
#define SGPIO_LED_MODE_BLINK_1HZ          (2U)
#define SGPIO_LED_MODE_BLINK_4HZ          (3U)
#define SGPIO_LED_ACTIVITY_OFF_LEVEL      (0U)
#define SGPIO_LED_ACTIVITY_ON_LEVEL       (1U)
#define SGPIO_LED_STATUS_OFF_LEVEL        (1U)
#define SGPIO_LED_STATUS_ON_LEVEL         (0U)
#define SGPIO_LED_1HZ_HALF_PERIOD_MS      (500UL)
#define SGPIO_LED_4HZ_HALF_PERIOD_MS      (125UL)
#define LED0_4_ACT_N                      (PF4)
#define LED1_5_ACT_N                      (PF3)
#define LED2_6_ACT_N                      (PF2)
#define LED3_7_ACT_N                      (PC7)
#define LED3_7_STA_N                      (PC2)
#define LED2_6_STA_N                      (PC3)
#define LED1_5_STA_N                      (PC4)
#define LED0_4_STA_N                      (PC5)
#define LED0_4_ACT_N_PORT                 (PF)
#define LED1_5_ACT_N_PORT                 (PF)
#define LED2_6_ACT_N_PORT                 (PF)
#define LED3_7_ACT_N_PORT                 (PC)
#define LED3_7_STA_N_PORT                 (PC)
#define LED2_6_STA_N_PORT                 (PC)
#define LED1_5_STA_N_PORT                 (PC)
#define LED0_4_STA_N_PORT                 (PC)
#define LED0_4_ACT_N_PIN_MASK             (BIT4)
#define LED1_5_ACT_N_PIN_MASK             (BIT3)
#define LED2_6_ACT_N_PIN_MASK             (BIT2)
#define LED3_7_ACT_N_PIN_MASK             (BIT7)
#define LED3_7_STA_N_PIN_MASK             (BIT2)
#define LED2_6_STA_N_PIN_MASK             (BIT3)
#define LED1_5_STA_N_PIN_MASK             (BIT4)
#define LED0_4_STA_N_PIN_MASK             (BIT5)
#ifndef SPLIT_ODn_GROUP_A_B
#define SPLIT_ODn_GROUP_A_B               (0U)
#endif
#define SPLIT_ODn_GROUP_PCB_A             (0U)
#define SPLIT_ODn_GROUP_PCB_B             (1U)
#ifndef SPLIT_ODn_GROUP_BOARD
#define SPLIT_ODn_GROUP_BOARD             (SPLIT_ODn_GROUP_PCB_A)
#endif

static volatile uint8_t g_sgpio_capture_active = 0U;
static volatile uint8_t g_sgpio_marker_seen = 0U;
static volatile uint8_t g_sgpio_frame_ready = 0U;
static volatile uint8_t g_sgpio_overflow = 0U;
static volatile uint8_t g_sgpio_low_sync_count = 0U;
static volatile uint8_t g_sgpio_low_sync_at_marker = 0U;
static volatile uint8_t g_sgpio_sload_raw = 0U;
static volatile uint8_t g_sgpio_sload_raw_valid = 0U;
static volatile uint16_t g_sgpio_slot_bit_count = 0U;
static volatile uint8_t g_sgpio_raw[SGPIO_SLAVE_RX_MAX_BYTES];
static volatile uint32_t g_sgpio_frame_count = 0UL;
static volatile uint32_t g_sgpio_dropped_frames = 0UL;
static volatile unsigned long g_sgpio_capture_start_tick = 0UL;
static volatile unsigned long g_sgpio_last_clock_tick = 0UL;

static SGPIO_FRAME_T g_sgpio_last_frame;
static SGPIO_FRAME_T g_sgpio_filter_candidate;
static unsigned long g_sgpio_last_log_tick = 0UL;
static unsigned long g_sgpio_last_unstable_log_tick = 0UL;
static uint8_t g_sgpio_filter_candidate_valid = 0U;
static uint8_t g_sgpio_filter_repeat_count = 0U;
static uint8_t g_sgpio_activity_mode[SGPIO_LED_GROUP_COUNT];
static uint8_t g_sgpio_status_mode[SGPIO_LED_GROUP_COUNT];
static uint32_t g_sgpio_led_last_apply_tick = 0xFFFFFFFFUL;

/*_____ F U N C T I O N S __________________________________________________*/
static void sgpio_clear_raw(void)
{
    uint8_t i;

    for (i = 0U; i < SGPIO_SLAVE_RX_MAX_BYTES; i++)
    {
        g_sgpio_raw[i] = 0U;
    }
}

static void sgpio_reset_capture_state(void)
{
    sgpio_clear_raw();
    g_sgpio_capture_active = 0U;
    g_sgpio_marker_seen = 0U;
    g_sgpio_overflow = 0U;
    g_sgpio_low_sync_count = 0U;
    g_sgpio_low_sync_at_marker = 0U;
    g_sgpio_sload_raw = 0U;
    g_sgpio_sload_raw_valid = 0U;
    g_sgpio_slot_bit_count = 0U;
    g_sgpio_capture_start_tick = 0UL;
    g_sgpio_last_clock_tick = 0UL;
}

static void sgpio_store_sdata_bit(uint8_t bit_value)
{
    uint16_t bit_index;
    uint8_t byte_index;
    uint8_t bit_mask;

    bit_index = g_sgpio_slot_bit_count;
    if (bit_index >= SGPIO_SLOT_BIT_MAX)
    {
        /* Ignore frame padding after the 16 standard SGPIO slots. */
        return;
    }

    byte_index = (uint8_t)(bit_index >> 3U);
    bit_mask = (uint8_t)(1U << (bit_index & 0x7U));

    if (byte_index < SGPIO_SLAVE_RX_MAX_BYTES)
    {
        if (bit_value != 0U)
        {
            g_sgpio_raw[byte_index] = (uint8_t)(g_sgpio_raw[byte_index] | bit_mask);
        }
    }
    else
    {
        g_sgpio_overflow = 1U;
    }

    g_sgpio_slot_bit_count++;
}

static uint8_t sgpio_get_raw_bit(const uint8_t *raw, uint16_t bit_index)
{
    uint8_t byte_index;
    uint8_t bit_mask;
    uint8_t value;

    byte_index = (uint8_t)(bit_index >> 3U);
    bit_mask = (uint8_t)(1U << (bit_index & 0x7U));

