released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/sgpio_slave.c
    if (byte_index >= SGPIO_SLAVE_RX_MAX_BYTES)
    {
        value = 0U;
    }
    else if ((raw[byte_index] & bit_mask) != 0U)
    {
        value = 1U;
    }
    else
    {
        value = 0U;
    }

    return value;
}

static uint8_t sgpio_is_valid_captured_bit_count(uint16_t bit_count)
{
    uint8_t valid;

    /*
     * Pico emits SGPIO pairs in 16-pair PIO words. After the restart marker,
     * a valid M032 RX-only capture is 26 bits for slot counts 1..8, 42 bits
     * for slot counts 9..14, or capped at 48 bits for slot counts 15..16.
     */
    if ((bit_count == 26U) || (bit_count == 42U) || (bit_count == SGPIO_SLOT_BIT_MAX))
    {
        valid = 1U;
    }
    else
    {
        valid = 0U;
    }

    return valid;
}

static void sgpio_finalize_capture(void)
{
    if ((g_sgpio_marker_seen != 0U) && (g_sgpio_slot_bit_count > 0U) && (g_sgpio_frame_ready == 0U))
    {
        g_sgpio_frame_count++;
        g_sgpio_frame_ready = 1U;
    }
    else if (g_sgpio_frame_ready != 0U)
    {
        g_sgpio_dropped_frames++;
    }

    g_sgpio_capture_active = 0U;
    g_sgpio_marker_seen = 0U;
}

static void sgpio_copy_frame_from_isr(SGPIO_FRAME_T *frame)
{
    uint8_t i;

    memset(frame, 0, sizeof(*frame));
    frame->frame_count = g_sgpio_frame_count;
    frame->dropped_frames = g_sgpio_dropped_frames;
    frame->bit_count = g_sgpio_slot_bit_count;
    frame->overflow = g_sgpio_overflow;
    frame->sload_raw = (uint8_t)(g_sgpio_sload_raw & 0x0FU);
    frame->sload_raw_valid = g_sgpio_sload_raw_valid;
    frame->low_sync_count = g_sgpio_low_sync_at_marker;
    frame->valid = 0U;

    if ((frame->low_sync_count >= SGPIO_LOW_SYNC_MIN_BITS) &&
        (sgpio_is_valid_captured_bit_count(frame->bit_count) != 0U))
    {
        frame->valid = 1U;
    }

    frame->raw_len = (uint8_t)((frame->bit_count + 7U) >> 3U);
    if (frame->raw_len > SGPIO_SLAVE_RX_MAX_BYTES)
    {
        frame->raw_len = SGPIO_SLAVE_RX_MAX_BYTES;
    }

    for (i = 0U; i < SGPIO_SLAVE_RX_MAX_BYTES; i++)
    {
        frame->raw[i] = g_sgpio_raw[i];
    }

    g_sgpio_frame_ready = 0U;
}

static void sgpio_decode_frame(SGPIO_FRAME_T *frame)
{
    uint8_t slot;
    uint16_t bit_index;

    frame->act_mask = 0U;
    frame->locate_mask = 0U;
    frame->fail_mask = 0U;

    for (slot = 0U; slot < SGPIO_DECODE_SLOT_COUNT; slot++)
    {
        bit_index = (uint16_t)(slot * SGPIO_DATA_BITS_PER_SLOT);
        if ((uint16_t)(bit_index + 2U) >= frame->bit_count)
        {
            break;
        }

        if (sgpio_get_raw_bit(frame->raw, bit_index) != 0U)
        {
            frame->act_mask |= (uint16_t)(1UL << slot);
        }
        if (sgpio_get_raw_bit(frame->raw, (uint16_t)(bit_index + 1U)) != 0U)
        {
            frame->locate_mask |= (uint16_t)(1UL << slot);
        }
        if (sgpio_get_raw_bit(frame->raw, (uint16_t)(bit_index + 2U)) != 0U)
        {
            frame->fail_mask |= (uint16_t)(1UL << slot);
        }
    }
}

static void sgpio_print_slot_mask(const char *label, uint16_t mask)
{
    uint8_t slot;
    uint8_t printed;

    printf("%s", label);
    printed = 0U;
    for (slot = 0U; slot < SGPIO_DECODE_SLOT_COUNT; slot++)
    {
        if ((mask & (uint16_t)(1UL << slot)) != 0U)
        {
            if (printed != 0U)
            {
                printf(",");
            }
            printf("%u", (unsigned int)slot);
            printed = 1U;
        }
    }

    if (printed == 0U)
    {
        printf("-");
    }
}

static void sgpio_print_slot_decode(const SGPIO_FRAME_T *frame)
{
    printf("  slots: ");
    sgpio_print_slot_mask("ACT=", frame->act_mask);
    printf(" ");
    sgpio_print_slot_mask("LOCATE=", frame->locate_mask);
    printf(" ");
    sgpio_print_slot_mask("FAIL=", frame->fail_mask);
    printf("\r\n");
}

static void sgpio_print_raw_bytes(const SGPIO_FRAME_T *frame)
{
    uint8_t i;

    printf("  raw:");
    for (i = 0U; i < frame->raw_len; i++)
    {
        printf(" %02X", (unsigned int)frame->raw[i]);
    }
    if (frame->raw_len == 0U)
    {
        printf(" -");
    }
    printf("\r\n");
}

static void sgpio_print_slot_bits(const SGPIO_FRAME_T *frame)
{
    uint8_t slot;
    uint8_t act_bit;
    uint8_t locate_bit;
    uint8_t fail_bit;
    uint8_t printed;
    uint16_t bit_index;

    printed = 0U;
    printf("  bits S0..S7:");
    for (slot = 0U; slot < SGPIO_DECODE_SLOT_COUNT; slot++)
    {
        bit_index = (uint16_t)(slot * SGPIO_DATA_BITS_PER_SLOT);
        if ((uint16_t)(bit_index + 2U) >= frame->bit_count)
        {
            break;
        }

        act_bit = sgpio_get_raw_bit(frame->raw, bit_index);
        locate_bit = sgpio_get_raw_bit(frame->raw, (uint16_t)(bit_index + 1U));
        fail_bit = sgpio_get_raw_bit(frame->raw, (uint16_t)(bit_index + 2U));
        if (slot == 8U)
        {
            printf("\r\n  bits S8..S15:");
        }
        printf(" S%u=%u%u%u",
               (unsigned int)slot,
               (unsigned int)act_bit,
               (unsigned int)locate_bit,
               (unsigned int)fail_bit);
        printed = 1U;
    }
    if (printed == 0U)
    {
        printf(" -");
    }
    printf("\r\n");
}

/*
 * SGPIO SDATAOUT raw bytes are logged LSB-first in capture order.
 * For slot N:
 *   bit (N * 3) + 0 = ACT
 *   bit (N * 3) + 1 = LOCATE
 *   bit (N * 3) + 2 = FAIL
 *
 * Example:
 *   raw 38 8E C3 00
 *   byte 0x38 is read as bits 0,0,0,1,1,1,0,0
 *   triples are printed as:
 *   bits S0..S7: S0=000 S1=111 S2=000 S3=111 S4=000 S5=111 S6=000 S7=011
 *   bits S8..S15: S8=...
 * In each triple, the digit order is ACT, LOCATE, FAIL.
 */
static void sgpio_print_frame(const SGPIO_FRAME_T *frame)
{
    printf("[SGPIO RX] frame #%lu\r\n",
           (unsigned long)frame->frame_count);
    printf("  capture: bits=%u bytes=%u valid=%u overflow=%u dropped=%lu low_sync=%u\r\n",
           (unsigned int)frame->bit_count,
           (unsigned int)frame->raw_len,
           (unsigned int)frame->valid,
           (unsigned int)frame->overflow,
           (unsigned long)frame->dropped_frames,
           (unsigned int)frame->low_sync_count);
    printf("  sload: L0..L3=0x%X valid=%u\r\n",
           (unsigned int)frame->sload_raw,
           (unsigned int)frame->sload_raw_valid);
    printf("  masks: ACT=0x%04X LOCATE=0x%04X FAIL=0x%04X\r\n",
           (unsigned int)frame->act_mask,
           (unsigned int)frame->locate_mask,
           (unsigned int)frame->fail_mask);
    sgpio_print_raw_bytes(frame);
    sgpio_print_slot_bits(frame);
    sgpio_print_slot_decode(frame);
    printf("\r\n");
}

static void sgpio_led_clear_modes(void)
{
    uint8_t group;

