released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/sgpio_slave.c
    if (same != 0U)
    {
        for (i = 0U; i < SGPIO_SLAVE_RX_MAX_BYTES; i++)
        {
            if (a->raw[i] != b->raw[i])
            {
                same = 0U;
                break;
            }
        }
    }

    return same;
}

static void sgpio_set_filter_candidate(const SGPIO_FRAME_T *frame)
{
    memcpy(&g_sgpio_filter_candidate, frame, sizeof(g_sgpio_filter_candidate));
    g_sgpio_filter_candidate_valid = 1U;
    g_sgpio_filter_repeat_count = 1U;
}

static void sgpio_print_unstable_frame(const SGPIO_FRAME_T *frame, unsigned long now)
{
    if ((unsigned long)(now - g_sgpio_last_unstable_log_tick) < SGPIO_UNSTABLE_LOG_MIN_INTERVAL_MS)
    {
        return;
    }

    printf("[SGPIO RX] unstable frame ignored\r\n");
    printf("  capture: bits=%u bytes=%u valid=%u overflow=%u low_sync=%u\r\n",
           (unsigned int)frame->bit_count,
           (unsigned int)frame->raw_len,
           (unsigned int)frame->valid,
           (unsigned int)frame->overflow,
           (unsigned int)frame->low_sync_count);
    printf("  raw0=0x%02X candidate_repeat=%u\r\n\r\n",
           (unsigned int)frame->raw[0],
           (unsigned int)g_sgpio_filter_repeat_count);
    g_sgpio_last_unstable_log_tick = now;
}

static uint8_t sgpio_accept_stable_frame(const SGPIO_FRAME_T *frame, unsigned long now)
{
    uint8_t accepted;

    accepted = 0U;

    if ((frame->valid == 0U) || (frame->overflow != 0U))
    {
        sgpio_set_filter_candidate(frame);
        sgpio_print_unstable_frame(frame, now);
        return 0U;
    }

    if ((g_sgpio_last_frame.valid != 0U) && (sgpio_frame_same(frame, &g_sgpio_last_frame) != 0U))
    {
        accepted = 1U;
    }
    else if ((g_sgpio_filter_candidate_valid != 0U) &&
             (sgpio_frame_same(frame, &g_sgpio_filter_candidate) != 0U))
    {
        if (g_sgpio_filter_repeat_count < 0xFFU)
        {
            g_sgpio_filter_repeat_count++;
        }
        if (g_sgpio_filter_repeat_count >= SGPIO_FRAME_STABLE_REQUIRED)
        {
            accepted = 1U;
        }
    }
    else
    {
        sgpio_set_filter_candidate(frame);
    }

    if (accepted == 0U)
    {
        return 0U;
    }

    g_sgpio_filter_candidate_valid = 0U;
    g_sgpio_filter_repeat_count = 0U;
    return 1U;
}

void SGPIO_OnClockRisingSampledIrq(uint8_t sload_value, uint8_t sdata_value)
{
    unsigned long now;

    now = get_systick();

    if ((g_sgpio_capture_active != 0U) &&
        (g_sgpio_marker_seen != 0U) &&
        ((unsigned long)(now - g_sgpio_last_clock_tick) >= SGPIO_FRAME_GAP_TIMEOUT_MS))
    {
        sgpio_finalize_capture();
    }

    g_sgpio_last_clock_tick = now;

    if (g_sgpio_marker_seen == 0U)
    {
        if (sload_value == 0U)
        {
            if (g_sgpio_capture_active == 0U)
            {
                if (g_sgpio_frame_ready != 0U)
                {
                    g_sgpio_dropped_frames++;
                    g_sgpio_frame_ready = 0U;
                }

                sgpio_reset_capture_state();
                g_sgpio_capture_active = 1U;
                g_sgpio_capture_start_tick = now;
                g_sgpio_last_clock_tick = now;
            }

            if (g_sgpio_low_sync_count < 0xFFU)
            {
                g_sgpio_low_sync_count++;
            }
        }
        else if (g_sgpio_capture_active == 0U)
        {
            return;
        }
        else if (g_sgpio_low_sync_count >= SGPIO_LOW_SYNC_MIN_BITS)
        {
            g_sgpio_marker_seen = 1U;
            g_sgpio_low_sync_at_marker = g_sgpio_low_sync_count;
        }
        else
        {
            sgpio_reset_capture_state();
        }
        return;
    }

    if (g_sgpio_slot_bit_count < SGPIO_SLOAD_RAW_BITS)
    {
        if (sload_value != 0U)
        {
            g_sgpio_sload_raw = (uint8_t)(g_sgpio_sload_raw | (uint8_t)(1U << g_sgpio_slot_bit_count));
        }
        if (g_sgpio_slot_bit_count == (uint16_t)(SGPIO_SLOAD_RAW_BITS - 1U))
        {
            g_sgpio_sload_raw_valid = 1U;
        }
    }

    sgpio_store_sdata_bit(sdata_value);
}

void SGPIO_Process(void)
{
    SGPIO_FRAME_T local_frame;
    unsigned long now;

    sgpio_led_process();

    now = get_systick();

    if (g_sgpio_capture_active != 0U)
    {
        if (((g_sgpio_marker_seen != 0U) && ((unsigned long)(now - g_sgpio_last_clock_tick) >= SGPIO_FRAME_GAP_TIMEOUT_MS)) ||
            ((unsigned long)(now - g_sgpio_capture_start_tick) >= SGPIO_FRAME_ARM_TIMEOUT_MS))
        {
            NVIC_DisableIRQ(SGPIO_SLAVE_GPIO_IRQn);
            sgpio_finalize_capture();
            NVIC_EnableIRQ(SGPIO_SLAVE_GPIO_IRQn);
        }
    }

    if (g_sgpio_frame_ready == 0U)
    {
        return;
    }

    NVIC_DisableIRQ(SGPIO_SLAVE_GPIO_IRQn);
    sgpio_copy_frame_from_isr(&local_frame);
    sgpio_reset_capture_state();
    NVIC_EnableIRQ(SGPIO_SLAVE_GPIO_IRQn);

    sgpio_decode_frame(&local_frame);
    if (sgpio_accept_stable_frame(&local_frame, now) == 0U)
    {
        return;
    }
    memcpy(&g_sgpio_last_frame, &local_frame, sizeof(g_sgpio_last_frame));

    /*
     * Run product behavior for every stable accepted frame. Keep this outside
     * the debug log rate limit so SGPIO host commands are not delayed by
     * printf throttling.
     */
    sgpio_app_frame(&local_frame);

    if ((local_frame.frame_count <= SGPIO_FRAME_LOG_FIRST_N) ||
        ((unsigned long)(now - g_sgpio_last_log_tick) >= SGPIO_FRAME_LOG_MIN_INTERVAL_MS))
    {
        sgpio_print_frame(&local_frame);
        g_sgpio_last_log_tick = now;
    }
}

void SGPIO_Init(void)
{
    SYS_UnlockReg();

    /*
     * Keep SGPIO pins in GPIO function mode. The receiver uses the shared
     * GPIO port ISR; SLOAD and SDATA OUT are sampled synchronously by SCLK.
     */
    SYS->GPA_MFPL &= ~(SYS_GPA_MFPL_PA0MFP_Msk |
                       SYS_GPA_MFPL_PA2MFP_Msk |
                       SYS_GPA_MFPL_PA3MFP_Msk);
    SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC2MFP_Msk |
                                       SYS_GPC_MFPL_PC3MFP_Msk |
                                       SYS_GPC_MFPL_PC4MFP_Msk |
                                       SYS_GPC_MFPL_PC5MFP_Msk |
                                       SYS_GPC_MFPL_PC7MFP_Msk)) |
                    (SYS_GPC_MFPL_PC2MFP_GPIO |
                     SYS_GPC_MFPL_PC3MFP_GPIO |
                     SYS_GPC_MFPL_PC4MFP_GPIO |
                     SYS_GPC_MFPL_PC5MFP_GPIO |
                     SYS_GPC_MFPL_PC7MFP_GPIO);
    SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF2MFP_Msk |
                                       SYS_GPF_MFPL_PF3MFP_Msk |
                                       SYS_GPF_MFPL_PF4MFP_Msk)) |
                    (SYS_GPF_MFPL_PF2MFP_GPIO |
                     SYS_GPF_MFPL_PF3MFP_GPIO |
                     SYS_GPF_MFPL_PF4MFP_GPIO);

    SYS_LockReg();

    GPIO_SetMode(SGPIO_SLAVE_SLOAD_PORT, SGPIO_SLAVE_SLOAD_PIN_MASK, GPIO_MODE_INPUT);
    GPIO_SetMode(SGPIO_SLAVE_SDOUT_PORT, SGPIO_SLAVE_SDOUT_PIN_MASK, GPIO_MODE_INPUT);
    GPIO_SetMode(SGPIO_SLAVE_SCLK_PORT, SGPIO_SLAVE_SCLK_PIN_MASK, GPIO_MODE_INPUT);
    sgpio_led_preset_off_levels();
    GPIO_SetMode(LED0_4_ACT_N_PORT, LED0_4_ACT_N_PIN_MASK, GPIO_MODE_OUTPUT);
    GPIO_SetMode(LED1_5_ACT_N_PORT, LED1_5_ACT_N_PIN_MASK, GPIO_MODE_OUTPUT);
    GPIO_SetMode(LED2_6_ACT_N_PORT, LED2_6_ACT_N_PIN_MASK, GPIO_MODE_OUTPUT);
    GPIO_SetMode(LED3_7_ACT_N_PORT, LED3_7_ACT_N_PIN_MASK, GPIO_MODE_OUTPUT);
    GPIO_SetMode(LED0_4_STA_N_PORT, LED0_4_STA_N_PIN_MASK, GPIO_MODE_OUTPUT);
    GPIO_SetMode(LED1_5_STA_N_PORT, LED1_5_STA_N_PIN_MASK, GPIO_MODE_OUTPUT);
    GPIO_SetMode(LED2_6_STA_N_PORT, LED2_6_STA_N_PIN_MASK, GPIO_MODE_OUTPUT);
    GPIO_SetMode(LED3_7_STA_N_PORT, LED3_7_STA_N_PIN_MASK, GPIO_MODE_OUTPUT);

    sgpio_reset_capture_state();
    sgpio_led_clear_modes();
    g_sgpio_led_last_apply_tick = 0xFFFFFFFFUL;
    sgpio_led_process();
    memset(&g_sgpio_last_frame, 0, sizeof(g_sgpio_last_frame));
    memset(&g_sgpio_filter_candidate, 0, sizeof(g_sgpio_filter_candidate));
    g_sgpio_filter_candidate_valid = 0U;
    g_sgpio_filter_repeat_count = 0U;
    g_sgpio_last_unstable_log_tick = 0UL;

    GPIO_CLR_INT_FLAG(SGPIO_SLAVE_SLOAD_PORT, SGPIO_SLAVE_SLOAD_PIN_MASK);
    GPIO_CLR_INT_FLAG(SGPIO_SLAVE_SDOUT_PORT, SGPIO_SLAVE_SDOUT_PIN_MASK);
    GPIO_CLR_INT_FLAG(SGPIO_SLAVE_SCLK_PORT, SGPIO_SLAVE_SCLK_PIN_MASK);

    GPIO_DisableInt(SGPIO_SLAVE_SLOAD_PORT, SGPIO_SLAVE_SLOAD_PIN_NUM);
    GPIO_DisableInt(SGPIO_SLAVE_SDOUT_PORT, SGPIO_SLAVE_SDOUT_PIN_NUM);
    GPIO_EnableInt(SGPIO_SLAVE_SCLK_PORT, SGPIO_SLAVE_SCLK_PIN_NUM, GPIO_INT_RISING);

    NVIC_ClearPendingIRQ(SGPIO_SLAVE_GPIO_IRQn);
    NVIC_EnableIRQ(SGPIO_SLAVE_GPIO_IRQn);

    printf("%s/SLOAD GPIO input sampled by SCLK\r\n", SGPIO_SLAVE_SLOAD_PIN_NAME);
    printf("%s/SDATAOUT GPIO input sampled by SCLK\r\n", SGPIO_SLAVE_SDOUT_PIN_NAME);
    printf("%s/SCLK shared GPIO ISR rising sampler\r\n", SGPIO_SLAVE_SCLK_PIN_NAME);
    printf("SGPIO GPIO ISR RX path, no SDATAIN TX\r\n");
}

void SGPIO_SLAVE_GPIO_IRQHandler(void)
{
    uint32_t sclk_pending;
    uint8_t sload_sample;
    uint8_t sdata_sample;

    /*
     * Shared GPIO port ISR rule:
     * the selected SCLK bit check must remain the first top-level branch in
     * this common GPIO handler. SGPIO depends on every SCLK rising edge, so
     * future unrelated GPIO handling must be added below this block and must
     * not delay the SCLK sampling path.
     */
    sclk_pending = GPIO_GET_INT_FLAG(SGPIO_SLAVE_SCLK_PORT, SGPIO_SLAVE_SCLK_PIN_MASK);
    if (sclk_pending != 0UL)
    {
        sload_sample = SGPIO_SLAVE_SLOAD_IO;
        sdata_sample = SGPIO_SLAVE_SDOUT_IO;
        GPIO_CLR_INT_FLAG(SGPIO_SLAVE_SCLK_PORT, SGPIO_SLAVE_SCLK_PIN_MASK);
        SGPIO_OnClockRisingSampledIrq(sload_sample, sdata_sample);
    }
}
